[
    {
        "name": "Readme",
        "fileName": "Readme",
        "fileType": "md",
        "year": 2024
    },
    {
        "name": "Resume",
        "fileName": "ChloeSonsteng_Developer_Resume",
        "fileType": "pdf",
        "year": 2024,
        "content": "This is my resume! You can find more details about any specific position under Employment History."
    },
    {
        "name": "Games",
        "fileType": "dir",
        "content": 
        [
            {
                "name": "Storkdle",
                "fileName": "https://www.storkdle.com/",
                "fileType": "react",
                "year": 2024,
                "content": "Storkdle is a Wordle clone that gives clues based on number and type of stroke in each letter. It was my first real React project. The game still needs a tutorial, but basically green means a letter is correct, yellow means it has the correct number of strokes, but not type of strokes, and blue means it is the correct number and type. Example: T and P each share 2 strokes but not the same type (1 curve, 1 straight) whereas T and L both share 2 straight strokes."
            },
            {
                "name": "Gem Puzzle",
                "fileName": "GemPuzzle",
                "fileType": "unity",
                "year": 2021,
                "hide": true,
                "content": "A weird little math puzzle built entirely in Unity UI components for whatever reason. It was an afternoon project one day while I was bored back in 2021."
            },
            {
                "name": "Decommission",
                "fileName": "Decommission",
                "fileType": "unity",
                "year": 2021,
                "content": "Decommission was made for the ScoreSpace #13 Game Jam in May of 2021. It had the required theme of \"Dodging\" with an optional challenge of \"One Room\". The length of the jam was 72 hours. The game was inspired by the old flash game [Seconds of Madness](https://www.addictinggames.com/sports/seconds-of-madness)\n\nPlease excuse the abrasive music, I may have overdone the industrial vibe."
            },
            {
                "name": "Punch Card Hell",
                "fileName": "OfficeHell",
                "fileType": "unity",
                "year": 2020,
                "content": "Punch Card Hell was my first ever game jam from December of 2020. It was for the Mini Game Jam #69. The theme was \"Hell\" and cards were a required mechanic. The length of the jam was 72 hours. It is made to be the GroundHog Day work week of Hell. I did probably overdo it on challenge factor as I didn't have a whole lot of time left to balance. I also wish I had went for a different control scheme as the tank controls are infuriating."
            },
            {
                "name": "Psionic Squish",
                "fileName": "PsionicSquish",
                "fileType": "unity",
                "year": 2022,
                "content": "Psionic Squish is very much a work in progress game, even though I haven't touched it significantly in a few years. Tactical turn based games are one of my favorite genres, especially if they are procedurally generated. This is inspired heavily by [Invisible Inc.](https://www.klei.com/games/invisible-inc) with a fantasy twist. I have a lot of the overall design and narrative work done, and just need to get back to implementing. \n\nMy biggest challenge is trying to figure out how to keep the levels feeling engaging while still spacious and unique. The current level starts out very unexciting."
            },
            {
                "name": "Labyrinth",
                "fileName": "Labryinth",
                "fileType": "unity",
                "year": 2023,
                "content": "This is one of my most recent projects. I wanted to play around with procedurally generated geometry and am a fan of both mazes and horror. I really want this game to feel like something could always be around the corner. I want tension without real danger. I have not yet figured out enemy design for that yet. It also definitely needs a better enemy model, and a better way to track your way through the maze. "
            },
            {
                "name": "Mount Tucker",
                "fileName": "MountTucker",
                "fileType": "unity",
                "year": 2020,
                "hide": true,
                "content": "I only uploaded this game as a kick to make myself get back to working on it. It is my oldest game and I was working on it in 2020 before working at DropBears. I haven't picked it back up since I got that job. I have a whole notebook of design to collate and implement. It is inspired by both Twin Peaks and Stardew Valley."
            },
            {
                "name": "Chess",
                "fileName": "Chess",
                "fileType": "unity",
                "year": 2021,
                "content": "I got bored one weekend in 2021 and decided to make a chess engine. The pieces were from the Unity asset store. It currently does not handle pawn promotion or en passant. Also the AI could use some openings and some overall improvement."
            },
            {
                "name": "CorpoHack",
                "fileName": "CorpoHack",
                "fileType": "unity",
                "year": 2024,
                "content": "I started this project in the summer of 2024, and it is very much in a prototype stage."
            }
        ]
    },
    {
        "name": "TTRPG",
        "fileType": "dir",
        "content": 
        [
            {
                "name": "Haefallia",
                "fileName": "Haefallia",
                "fileType": "pdf",
                "year": 2022,
                "content": "This is a module I wrote for my Dungeons & Dragons campaign setting. It has 3 new races and a new class plus new subclasses and backgrounds. Formatting was done with [Homebrewery](https://homebrewery.naturalcrit.com/)."
            },
            {
                "name": "Goravin",
                "fileName": "Goravin",
                "fileType": "pdf",
                "year": 2019,
                "content": "I really wanted to run a sci-fi/cyberpunk game with my friends. It was before CyberPunk Red was out, so I made my own! We only played it a couple of times before returning to D&D."
            },
            {
                "name": "Maps",
                "fileType": "dir",
                "content": 
                [
                    {
                        "name": "NEGalinndan",
                        "fileName": "NEGalinndan",
                        "fileType": "jpg",
                        "alt": "Custom D&D Region Map",
                        "year": 2020,
                        "content": "This is a hand-drawn map for a previous D&D campaign from 2020."
                    },{
                        "name": "NWGalinndan",
                        "fileName": "NWGalinndan",
                        "fileType": "jpg",
                        "alt": "Custom D&D Region Map",
                        "year": 2020,
                        "content": "This is a hand-drawn map for a previous D&D campaign from 2020."
                    },
                    {
                        "name": "NWKuali",
                        "fileName": "NWKuali",
                        "fileType": "jpg",
                        "alt": "Custom D&D Region Map",
                        "year": 2020,
                        "content": "This is a hand-drawn map for a previous D&D campaign from 2020."
                    },
                    {
                        "name": "Kuali-Galinndan",
                        "fileName": "Kuali-Galinndan",
                        "fileType": "jpg",
                        "alt": "Custom D&D Region Map",
                        "year": 2020,
                        "content": "This is a hand-drawn map for a previous D&D campaign from 2020."
                    }
                ]
            }
        ]
    },
    {
        "name": "Employment History",
        "fileType": "dir",
        "content": 
        [
            {
                "name": "Internships",
                "fileName": "Internships",
                "fileType": "md",
                "year": 2012
            },
            {
                "name": "Altech Aerospace",
                "fileName": "Altech",
                "fileType": "md",
                "year": 2014
            },
            {
                "name": "DigiTop",
                "fileName": "DigiTop",
                "fileType": "md",
                "year": 2018
            },
            {
                "name": "DropBears Games",
                "fileName": "DropBears",
                "fileType": "md",
                "year": 2020
            },
            {
                "name": "Kodable",
                "fileName": "Kodable",
                "fileType": "md",
                "year": 2022
            }
        ]
    }
]